tap "browsh-org/browsh"
tap "clementtsang/bottom"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
tap "universal-ctags/universal-ctags"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# GNU Emacs text editor
brew "emacs", link: false
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Library to render SVG files using Cairo
brew "librsvg"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Trigger notifications when a process completes
brew "noti"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Password manager
brew "pass"
# Cross-platform application and UI framework
brew "qt", link: false
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# File browser
brew "ranger"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# PDF viewer
brew "xpdf", link: false
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# A cross-platform graphical process/system monitor with a customizable interface and a multitude of features.
brew "clementtsang/bottom/bottom"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Utility to set up alt-tab to switch between windows
cask "alt-tab"
# Clipboard manager with advanced features
cask "copyq"
# Text editor
cask "emacs"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
# Icon set and toolkit
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customizer
cask "karabiner-elements"
# Open-source keystroke visualizer
cask "keycastr"
# Minimal installer for conda with preinstalled support for Mamba
cask "mambaforge"
# Environment for statistical computing and graphics
cask "r"
# Customizable email client
cask "thunderbird"
# GUI for the Neovim text editor
cask "vimr"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Collect, organize, cite, and share research sources
cask "zotero"
